app/controllers/posts_controller.rb

  def create
    @current_user.posts.create posts_params
---
INSERT INTO "posts" ("title", "link", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["link", ""], ["user_id", 1], ["created_at", "2015-07-21 07:21:12.782931"], ["updated_at", "2015-07-21 07:21:12.782931"]]